IDEA Open Model
TendonLoading Class
Compatible with IDEA StatiCa Beta 20.0
 Tendon loading base class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.TendonLoading
 IdeaRS.OpenModel.Concrete.Load.TendonLossesLoading
 IdeaRS.OpenModel.Concrete.Load.TendonStressLoading
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class TendonLoading
Public MustInherit Class TendonLoading
The TendonLoading type exposes the following members.
Constructors
Name | Description
TendonLoading
Initializes a new instance of the TendonLoading class
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace